AccumulationRegisters/ЗаказыМатериаловСУчетомКорректировок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыМатериаловСУчетомКорректировок</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоУпаковок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Распоряжение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказМатериаловВПроизводство</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодСтрокиРаспоряжения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВариантОбеспечения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПотребности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отменено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроизводствоНаСтороне</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЗаказыМатериаловСУчетомКорректировок/Ext/RecordSetModule.bsl
//++ НЕ УТКА

//++ Устарело_Производство21

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если Не ПроведениеДокументов.РассчитыватьИзменения(ДополнительныеСвойства)
		Или Не ПолучитьФункциональнуюОпцию("ИспользоватьКорректировкиЗаказаМатериаловВПроизводство")Тогда
		Возврат;
	КонецЕсли;
	
	БлокироватьДляИзменения = Истина;
	
	// Текущее состояние набора помещается во временную таблицу "ДвиженияТоварыКОтгрузкеПередЗаписью",
	// чтобы при записи получить изменение нового набора относительно текущего.
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.УстановитьПараметр("ЭтоНовый",    ДополнительныеСвойства.СвойстваДокумента.ЭтоНовый);
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таблица.Организация                КАК Организация,
	|	Таблица.Подразделение              КАК Подразделение,
	|	Таблица.Распоряжение               КАК Распоряжение,
	|	Таблица.КодСтрокиРаспоряжения      КАК КодСтрокиРаспоряжения,
	|	Таблица.ВариантОбеспечения         КАК ВариантОбеспечения,
	|	Таблица.ДатаПотребности            КАК ДатаПотребности,
	|	Таблица.КодСтроки                  КАК КодСтроки,
	|	Таблица.Отменено                   КАК Отменено,
	|	Таблица.ПроизводствоНаСтороне      КАК ПроизводствоНаСтороне,
	|	Таблица.Серия                      КАК Серия,
	|	Таблица.Склад                      КАК Склад,
	|	Таблица.Упаковка                   КАК Упаковка,
	|	Таблица.КоличествоУпаковок         КАК КоличествоУпаковокПередЗаписью
	|ПОМЕСТИТЬ ДвиженияЗаказыМатериаловСУчетомКорректировокПередЗаписью
	|ИЗ
	|	РегистрНакопления.ЗаказыМатериаловСУчетомКорректировок КАК Таблица
	|ГДЕ
	|	Таблица.Регистратор = &Регистратор
	|	И НЕ &ЭтоНовый";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПроведениеДокументов.РассчитыватьИзменения(ДополнительныеСвойства)
		Или Не ПолучитьФункциональнуюОпцию("ИспользоватьКорректировкиЗаказаМатериаловВПроизводство") Тогда
		Возврат;
	КонецЕсли;
	
	// Рассчитывается изменение нового набора относительно текущего с учетом накопленных изменений
	// и помещается во временную таблицу.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаИзменений.Организация                КАК Организация,
	|	ТаблицаИзменений.Подразделение              КАК Подразделение,
	|	ТаблицаИзменений.Распоряжение               КАК Распоряжение,
	|	ТаблицаИзменений.КодСтрокиРаспоряжения      КАК КодСтрокиРаспоряжения,
	|	ТаблицаИзменений.ВариантОбеспечения         КАК ВариантОбеспечения,
	|	ТаблицаИзменений.ДатаПотребности            КАК ДатаПотребности,
	|	ТаблицаИзменений.КодСтроки                  КАК КодСтроки,
	|	ТаблицаИзменений.Отменено                   КАК Отменено,
	|	ТаблицаИзменений.ПроизводствоНаСтороне      КАК ПроизводствоНаСтороне,
	|	ТаблицаИзменений.Серия                      КАК Серия,
	|	ТаблицаИзменений.Склад                      КАК Склад,
	|	ТаблицаИзменений.Упаковка                   КАК Упаковка,
	|	СУММА(ТаблицаИзменений.КоличествоУпаковокИзменение) КАК КоличествоУпаковокИзменение
	|ПОМЕСТИТЬ ЗаказыМатериаловСУчетомКорректировокИзменение
	|ИЗ
	|	(ВЫБРАТЬ
	|		Таблица.Организация                КАК Организация,
	|		Таблица.Подразделение              КАК Подразделение,
	|		Таблица.Распоряжение               КАК Распоряжение,
	|		Таблица.КодСтрокиРаспоряжения      КАК КодСтрокиРаспоряжения,
	|		Таблица.ВариантОбеспечения         КАК ВариантОбеспечения,
	|		Таблица.ДатаПотребности            КАК ДатаПотребности,
	|		Таблица.КодСтроки                  КАК КодСтроки,
	|		Таблица.Отменено                   КАК Отменено,
	|		Таблица.ПроизводствоНаСтороне      КАК ПроизводствоНаСтороне,
	|		Таблица.Серия                      КАК Серия,
	|		Таблица.Склад                      КАК Склад,
	|		Таблица.Упаковка                   КАК Упаковка,
	|		Таблица.КоличествоУпаковокПередЗаписью КАК КоличествоУпаковокИзменение
	|	ИЗ
	|		ДвиженияЗаказыМатериаловСУчетомКорректировокПередЗаписью КАК Таблица
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Организация                КАК Организация,
	|		Таблица.Подразделение              КАК Подразделение,
	|		Таблица.Распоряжение               КАК Распоряжение,
	|		Таблица.КодСтрокиРаспоряжения      КАК КодСтрокиРаспоряжения,
	|		Таблица.ВариантОбеспечения         КАК ВариантОбеспечения,
	|		Таблица.ДатаПотребности            КАК ДатаПотребности,
	|		Таблица.КодСтроки                  КАК КодСтроки,
	|		Таблица.Отменено                   КАК Отменено,
	|		Таблица.ПроизводствоНаСтороне      КАК ПроизводствоНаСтороне,
	|		Таблица.Серия                      КАК Серия,
	|		Таблица.Склад                      КАК Склад,
	|		Таблица.Упаковка                   КАК Упаковка,
	|		-Таблица.КоличествоУпаковок        КАК КоличествоУпаковокИзменение
	|	ИЗ
	|		РегистрНакопления.ЗаказыМатериаловСУчетомКорректировок КАК Таблица
	|	ГДЕ
	|		Таблица.Регистратор = &Регистратор) КАК ТаблицаИзменений
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаИзменений.Организация,
	|	ТаблицаИзменений.Подразделение,
	|	ТаблицаИзменений.Распоряжение,
	|	ТаблицаИзменений.КодСтрокиРаспоряжения,
	|	ТаблицаИзменений.ВариантОбеспечения,
	|	ТаблицаИзменений.ДатаПотребности,
	|	ТаблицаИзменений.КодСтроки,
	|	ТаблицаИзменений.Отменено,
	|	ТаблицаИзменений.ПроизводствоНаСтороне,
	|	ТаблицаИзменений.Серия,
	|	ТаблицаИзменений.Склад,
	|	ТаблицаИзменений.Упаковка
	|
	|ИМЕЮЩИЕ
	|	СУММА(ТаблицаИзменений.КоличествоУпаковокИзменение) > 0
	|;
	|УНИЧТОЖИТЬ ДвиженияЗаказыМатериаловСУчетомКорректировокПередЗаписью
	|";
	
	Выборка = Запрос.ВыполнитьПакет()[0].Выбрать();
	ПроведениеДокументов.ЗарегистрироватьТаблицуКонтроля(ДополнительныеСвойства,
		"ДвиженияЗаказыМатериаловСУчетомКорректировокИзменение", Выборка.Следующий() И Выборка.Количество > 0);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

//-- Устарело_Производство21

//-- НЕ УТКА
